---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeVertexArray.Size
source: html/2e0925e9-08a7-e657-a00c-6a90dea166c9.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray.Size Property

Returns the number of objects that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```